/**
  *********************************************************************
  * @file    main.c
  * @author  silence
  * @version V1.0
  * @date    2018-xx-xx
  * @brief   RT-Thread 3.0 + STM32
  * @attention
  **********************************************************************
  */ 
 
/*
*************************************************************************
*                             系统头文件
*************************************************************************
*/ 
#include "board.h"
#include "rtthread.h"


/*
*************************************************************************
*                               变量
*************************************************************************
*/
/* 任务控制掳块 */
static rt_thread_t led1_thread = RT_NULL;

/*
*************************************************************************
*                             任务函数
*************************************************************************
*/
static void led1_thread_entry(void* parameter);


/*
*************************************************************************
*                             main 函数
*************************************************************************
*/
/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{	
  /* 
   * 硬件初始化在board.c文件中的rt_hw_board_init()函数中完成，
   * 只需要在其中添加硬件初始化接口即可，其由rtthread_startup()
   * 函数调用，在主函数中创建线程及开启任务调度器即可。
   */
 
  led1_thread = 
  rt_thread_create( "led1",              //任务名
                    led1_thread_entry,   //任务函数
                    RT_NULL,             //任务函数参数
                    512,                 //任务堆栈
                    3,                   //任务优先级
                    20);                 //任务时间片
                   
  /* 启动线程，开启任务调度器 */
  if (led1_thread != RT_NULL) {
    rt_thread_startup(led1_thread);
  } else {
        return -1;
    }
}
	
/*
*************************************************************************
*                             线程函数
*************************************************************************
*/
  
static void led1_thread_entry(void* parameter)
{	
  while (1)
  {
    LED_ON;
    rt_thread_delay(500);   /* 延时500个tick */
    
    LED_OFF;     
    rt_thread_delay(500);   /* 延时500个tick */

  }
}

/********************************END OF FILE****************************/
